name: "yolov11-ensemble"
platform: "ensemble"
max_batch_size: 4

input [
  {
    name: "INPUT_IMAGES"
    data_type: TYPE_FP16
    format: FORMAT_NCHW
    dims: [3, 640, 640]
  }
]

output [
  {
    name: "BOXES"
    data_type: TYPE_FP32
    dims: [-1, 4]
  },
  {
    name: "SCORES"
    data_type: TYPE_FP32
    dims: [-1]
  },
  {
    name: "CLASSES"
    data_type: TYPE_INT32
    dims: [-1]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "yolov11-engine"
      model_version: 1
      input_map {
        key: "images"
        value: "INPUT_IMAGES"
      }
      output_map {
        key: "output0"
        value: "RAW_OUTPUTS"
      }
    },
    {
      model_name: "yolov11-nms"
      model_version: 1
      input_map {
        key: "output0"
        value: "RAW_OUTPUTS"
      }
      output_map [
        {
          key: "boxes"
          value: "BOXES"
        },
        {
          key: "scores"
          value: "SCORES"
        },
        {
          key: "classes"
          value: "CLASSES"
        }
      ]
    }
  ]
}
